<!-- terraform-plan-aws:stage -->
## 🟨 Terraform plan (aws/stage) — Changes detected
**Changes:** +17 ~4 -1
**Time:**
| TZ | Time |
| --- | --- |
| UTC | 2026-03-10, 10:12:26 p.m. |
| NZ | 2026-03-11, 11:12:26 a.m. |
| PT | 2026-03-10, 3:12:26 p.m. |
| ET | 2026-03-10, 6:12:26 p.m. |

Run: https://github.com/JesusFilm/forge/actions/runs/22926642256

```
module.platform.module.application.ephemeral.random_password.app_key_4: Opening...
module.platform.module.application.ephemeral.random_password.app_key_3: Opening...
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.app_key_1: Opening...
module.platform.module.application.ephemeral.random_password.api_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Opening...
module.platform.module.application.ephemeral.random_password.jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.encryption_key: Opening...
module.platform.module.application.ephemeral.random_password.app_key_1: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_4: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_2: Opening...
module.platform.module.application.ephemeral.random_password.app_key_3: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.encryption_key: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.api_token_salt: Opening complete after 0s
module.platform.module.assets.aws_acm_certificate.assets: Refreshing state... [id=arn:aws:acm:us-east-1:031374266475:certificate/78e7de72-ab8b-49f4-a40a-02bb7c0d4f4e]
module.platform.module.application.ephemeral.random_password.app_key_2: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Opening complete after 0s
data.aws_caller_identity.current: Reading...
module.iam.module.groups.module.require_mfa.data.aws_caller_identity.current: Reading...
data.aws_dynamodb_table.terraform_state_lock: Reading...
module.github.data.aws_caller_identity.current: Reading...
module.github.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::031374266475:oidc-provider/token.actions.githubusercontent.com]
module.iam.module.groups.module.billing.data.aws_iam_policy_document.billing: Reading...
module.platform.module.assets.aws_kms_key.assets: Refreshing state... [id=ebf807b3-624c-4a0f-9e6f-4c08f0eaff3e]
module.platform.module.application.aws_ecs_cluster.cms: Refreshing state... [id=arn:aws:ecs:us-east-2:031374266475:cluster/forge-cms-stage]
module.platform.module.assets.aws_s3_bucket.assets: Refreshing state... [id=forge-cms-stage-assets]
module.iam.module.groups.module.billing.data.aws_iam_policy_document.billing: Read complete after 0s [id=3512268210]
module.platform.module.application.aws_acm_certificate.alb: Refreshing state... [id=arn:aws:acm:us-east-2:031374266475:certificate/a62eb55a-e4cf-4375-adb1-a73b5232f28a]
module.iam.module.groups.module.require_mfa.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.module.assets.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.github.data.aws_iam_policy.github_actions_terraform_apply[0]: Reading...
module.github.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
data.aws_route53_zone.forge[0]: Reading...
module.platform.module.assets.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.aws_s3_bucket.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.data.aws_availability_zones.available: Reading...
module.platform.data.aws_caller_identity.current: Reading...
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.module.assets.aws_s3_bucket.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
data.aws_dynamodb_table.terraform_state_lock: Read complete after 0s [id=forge-terraform-locks]
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Reading...
module.platform.module.application.aws_ecr_repository.cms: Refreshing state... [id=forge-cms-stage]
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Read complete after 0s [id=3920620134]
module.iam.module.groups.module.login_profile.data.aws_caller_identity.current: Reading...
module.platform.module.application.aws_iam_role.ecs_task: Refreshing state... [id=forge-cms-stage-task-role]
module.iam.module.groups.module.login_profile.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.aws_cloudwatch_log_group.waf: Refreshing state... [id=aws-waf-logs-forge-platform-stage]
data.aws_route53_zone.forge[0]: Read complete after 0s [id=Z078031724OHPW03IKVLO]
module.platform.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.platform.module.application.aws_iam_role.ecs_execution: Refreshing state... [id=forge-cms-stage-execution-role]
module.platform.module.application.aws_cloudwatch_log_group.cms: Refreshing state... [id=/ecs/forge-cms-stage]
module.platform.aws_vpc.platform: Refreshing state... [id=vpc-0040ec9fef124ece4]
module.github.data.aws_kms_alias.terraform_state: Reading...
module.platform.module.assets.aws_cloudfront_origin_access_control.assets: Refreshing state... [id=E2LML7ZZ1C2D9R]
module.platform.aws_eip.nat: Refreshing state... [id=eipalloc-0895205d6a27b7bee]
module.github.data.aws_kms_alias.terraform_state: Read complete after 0s [id=arn:aws:kms:us-east-2:031374266475:alias/forge-terraform-state]
module.platform.module.application.aws_kms_key.cms_ssm: Refreshing state... [id=5936d262-64d2-447d-8c57-2c8536b7c793]
module.iam.module.groups.module.require_mfa.data.aws_iam_policy_document.require_mfa: Reading...
data.aws_s3_bucket.terraform_state: Reading...
module.iam.module.groups.module.require_mfa.data.aws_iam_policy_document.require_mfa: Read complete after 0s [id=3095519315]
module.github.data.aws_iam_policy_document.github_actions_cms_deploy: Reading...
module.github.data.aws_iam_policy_document.github_actions_cms_deploy: Read complete after 0s [id=4270719246]
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role: Read complete after 0s [id=4015899160]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role: Read complete after 0s [id=309924271]
module.github.data.aws_iam_policy_document.github_actions_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=754675411]
module.platform.module.assets.aws_kms_alias.assets: Refreshing state... [id=alias/forge-cms-stage-assets]
module.iam.module.groups.module.login_profile.data.aws_iam_policy_document.login_profile: Reading...
module.iam.module.groups.module.login_profile.data.aws_iam_policy_document.login_profile: Read complete after 0s [id=352976214]
module.github.data.aws_kms_key.terraform_state: Reading...
module.platform.module.application.aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=forge-cms-stage-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.platform.module.assets.aws_s3_bucket_cors_configuration.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_versioning.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_server_side_encryption_configuration.assets: Refreshing state... [id=forge-cms-stage-assets]
module.github.data.aws_kms_key.terraform_state: Read complete after 0s [id=68220f21-2ca1-4846-9c2a-c8b6e268e63c]
module.platform.aws_s3_bucket_public_access_block.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
data.aws_s3_bucket.terraform_state: Read complete after 1s [id=forge-terraform-state-031374266475]
module.platform.data.aws_iam_policy_document.alb_logs: Reading...
module.platform.data.aws_iam_policy_document.alb_logs: Read complete after 0s [id=1858962669]
module.platform.aws_s3_bucket_server_side_encryption_configuration.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.github.aws_iam_role.github_actions_terraform_apply: Refreshing state... [id=forge-github-actions-terraform-apply-stage]
module.github.aws_iam_role.github_actions_terraform_plan: Refreshing state... [id=forge-github-actions-terraform-plan-stage]
module.github.aws_iam_role.github_actions_cms_deploy: Refreshing state... [id=forge-github-actions-cms-deploy-stage]
module.platform.module.assets.aws_s3_bucket_server_side_encryption_configuration.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.module.assets.data.aws_iam_policy_document.assets_access_logs: Reading...
module.platform.module.assets.data.aws_iam_policy_document.assets_access_logs: Read complete after 0s [id=323064003]
module.platform.module.assets.aws_s3_bucket_logging.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_public_access_block.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.module.application.aws_ssm_parameter.app_keys: Refreshing state... [id=/forge/aws/cms/stage/APP_KEYS]
module.platform.module.application.aws_ssm_parameter.api_token_salt: Refreshing state... [id=/forge/aws/cms/stage/API_TOKEN_SALT]
module.platform.module.application.aws_ssm_parameter.encryption_key: Refreshing state... [id=/forge/aws/cms/stage/ENCRYPTION_KEY]
module.platform.module.application.aws_ssm_parameter.jwt_secret: Refreshing state... [id=/forge/aws/cms/stage/JWT_SECRET]
module.platform.module.application.aws_kms_alias.cms_ssm: Refreshing state... [id=alias/forge-cms-stage-ssm]
module.platform.module.application.aws_ssm_parameter.transfer_token_salt: Refreshing state... [id=/forge/aws/cms/stage/TRANSFER_TOKEN_SALT]
module.github.data.aws_iam_policy.github_actions_terraform_apply[0]: Read complete after 1s [id=arn:aws:iam::031374266475:policy/forge-github-actions-terraform-apply]
module.platform.module.application.aws_ssm_parameter.admin_jwt_secret: Refreshing state... [id=/forge/aws/cms/stage/ADMIN_JWT_SECRET]
module.platform.aws_s3_bucket_policy.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.module.assets.aws_s3_bucket_policy.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.module.application.data.aws_iam_policy_document.ecs_task: Reading...
module.platform.module.application.data.aws_iam_policy_document.ecs_task: Read complete after 0s [id=1330423022]
module.github.aws_iam_role_policy_attachment.github_actions_terraform_plan_readonly: Refreshing state... [id=forge-github-actions-terraform-plan-stage/arn:aws:iam::aws:policy/ReadOnlyAccess]
module.github.aws_ssm_parameter.terraform_aws_role_plan_arn: Refreshing state... [id=/forge/github/terraform_aws_role_plan_stage_arn]
module.github.aws_iam_role_policy.github_actions_cms_deploy: Refreshing state... [id=forge-github-actions-cms-deploy-stage:cms-deploy]
module.github.aws_ssm_parameter.terraform_aws_role_apply_arn: Refreshing state... [id=/forge/github/terraform_aws_role_apply_stage_arn]
module.github.aws_ssm_parameter.cms_deploy_role_arn: Refreshing state... [id=/forge/github/cms_deploy_role_arn_stage]
module.platform.module.application.aws_route53_record.alb_cert_validation["cms.stage.forge.jesusfilm.org"]: Refreshing state... [id=Z078031724OHPW03IKVLO__8c049a04c1fcb9caa395b6ff6c2322ab.cms.stage.forge.jesusfilm.org._CNAME]
module.platform.module.assets.aws_route53_record.assets_cert_validation["assets.stage.forge.jesusfilm.org"]: Refreshing state... [id=Z078031724OHPW03IKVLO__119fbb353ee3dad6d705782901195439.assets.stage.forge.jesusfilm.org._CNAME]
module.platform.module.application.aws_iam_role_policy.ecs_task: Refreshing state... [id=forge-cms-stage-task-role:forge-cms-stage-task-policy]
module.github.aws_iam_role_policy_attachment.github_actions_terraform_apply: Refreshing state... [id=forge-github-actions-terraform-apply-stage/arn:aws:iam::031374266475:policy/forge-github-actions-terraform-apply]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_ssm_kms: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_ssm_kms: Read complete after 0s [id=206155691]
module.github.aws_iam_role_policy.github_actions_terraform_plan_ssm_kms: Refreshing state... [id=forge-github-actions-terraform-plan-stage:terraform-plan-ssm-kms]
module.platform.aws_security_group.alb: Refreshing state... [id=sg-0075aef920fa1e986]
module.platform.aws_security_group.ecs_service: Refreshing state... [id=sg-0c75adbe59945b2e2]
module.platform.module.application.aws_lb_target_group.cms: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:targetgroup/forge-cms-stage-tg/73976e5b63c4370d]
module.platform.aws_internet_gateway.platform: Refreshing state... [id=igw-0dca6115df12a416c]
module.platform.aws_subnet.private[0]: Refreshing state... [id=subnet-08cb983444108cad4]
module.platform.aws_subnet.private[1]: Refreshing state... [id=subnet-08acf4d6a0cf91289]
module.platform.aws_subnet.public[0]: Refreshing state... [id=subnet-0ae5cc72794571e47]
module.platform.aws_subnet.public[1]: Refreshing state... [id=subnet-0650937425d48dd8f]
module.platform.module.application.aws_acm_certificate_validation.alb: Refreshing state... [id=2026-03-05 08:15:50.293 +0000 UTC]
module.platform.aws_security_group.rds: Refreshing state... [id=sg-0224a96f3740f4537]
module.platform.aws_route_table.public: Refreshing state... [id=rtb-02f919913a845c8a3]
module.platform.module.assets.aws_acm_certificate_validation.assets: Refreshing state... [id=2026-03-05 08:15:45.225 +0000 UTC]
module.platform.module.application.aws_vpc_security_group_egress_rule.alb_to_cms: Refreshing state... [id=sgr-06fda286a79c919bb]
module.platform.module.application.aws_vpc_security_group_ingress_rule.cms_from_alb: Refreshing state... [id=sgr-028258e5908101779]
module.platform.module.application.aws_db_subnet_group.cms: Refreshing state... [id=forge-cms-stage-db-subnets]
module.platform.aws_wafv2_web_acl.alb: Refreshing state... [id=efb05d09-b544-4c38-995e-b646ec91dd29]
module.platform.aws_lb.platform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:loadbalancer/app/forge-platform-stage-alb/dc88600f279821b0]
module.platform.module.assets.aws_cloudfront_distribution.assets: Refreshing state... [id=EJWPGU8999NAE]
module.platform.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a95ea0dfe84fc92b]
module.platform.aws_nat_gateway.platform: Refreshing state... [id=nat-025e58577ccb794fa]
module.platform.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05ab32ccd7e67f90f]
module.platform.aws_route_table.private: Refreshing state... [id=rtb-090fd093fd497c232]
module.platform.module.assets.aws_route53_record.assets_alias: Refreshing state... [id=Z078031724OHPW03IKVLO_assets.stage.forge.jesusfilm.org_A]
module.platform.module.assets.data.aws_iam_policy_document.assets_bucket: Reading...
module.platform.module.assets.data.aws_iam_policy_document.assets_bucket: Read complete after 0s [id=2742714030]
module.platform.module.assets.aws_s3_bucket_policy.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03f8ffd18d6d6b8e7]
module.platform.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03a23da7dfede2b5c]
module.platform.module.application.aws_route53_record.alb_alias: Refreshing state... [id=Z078031724OHPW03IKVLO_cms.stage.forge.jesusfilm.org_A]
module.platform.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener/app/forge-platform-stage-alb/dc88600f279821b0/96798e67efb942a4]
module.platform.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener/app/forge-platform-stage-alb/dc88600f279821b0/9afbee052137b89b]
module.platform.module.application.aws_db_instance.cms: Refreshing state... [id=db-IFW2HVA2RR22XVOXSTKMLAALH4]
module.platform.module.application.aws_lb_listener_rule.cms_host: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener-rule/app/forge-platform-stage-alb/dc88600f279821b0/96798e67efb942a4/44dd4fd01dabc8c2]
module.platform.module.application.aws_iam_role_policy.ecs_execution_secrets: Refreshing state... [id=forge-cms-stage-execution-role:forge-cms-stage-execution-secrets]
module.platform.module.application.aws_ecs_task_definition.cms: Refreshing state... [id=forge-cms-stage-task]
module.platform.module.application.aws_ecs_service.cms: Refreshing state... [id=arn:aws:ecs:us-east-2:031374266475:service/forge-cms-stage/forge-cms-stage-service]
module.platform.module.application.ephemeral.random_password.api_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.encryption_key: Closing...
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.app_key_1: Closing...
module.platform.module.application.ephemeral.random_password.app_key_2: Closing...
module.platform.module.application.ephemeral.random_password.app_key_4: Closing...
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.api_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.encryption_key: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_2: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_1: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_4: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Closing...
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_3: Closing...
module.platform.module.application.ephemeral.random_password.app_key_3: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.jwt_secret: Closing complete after 0s
module.platform.aws_wafv2_web_acl_association.alb: Refreshing state... [id=arn:aws:wafv2:us-east-2:031374266475:regional/webacl/forge-platform-stage-waf/efb05d09-b544-4c38-995e-b646ec91dd29,arn:aws:elasticloadbalancing:us-east-2:031374266475:loadbalancer/app/forge-platform-stage-alb/dc88600f279821b0]
module.platform.aws_wafv2_web_acl_logging_configuration.alb: Refreshing state... [id=arn:aws:wafv2:us-east-2:031374266475:regional/webacl/forge-platform-stage-waf/efb05d09-b544-4c38-995e-b646ec91dd29]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform.aws_s3_bucket_lifecycle_configuration.alb_logs will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "alb_logs" {
      + bucket                                 = "forge-platform-stage-alb-logs"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-log-objects"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }
        }
    }

  # module.platform.aws_s3_bucket_versioning.alb_logs will be created
  + resource "aws_s3_bucket_versioning" "alb_logs" {
      + bucket = "forge-platform-stage-alb-logs"
      + id     = (known after apply)
      + region = "us-east-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.platform.module.application.data.aws_iam_policy_document.ecs_execution_secrets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_execution_secrets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:us-east-2:031374266475:secret:rds!db-d7451672-ac58-4367-b108-27a607735078-R3xVdA",
            ]
          + sid       = "ReadRdsSecretForInjection"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/ADMIN_JWT_SECRET",
              + "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/API_TOKEN_SALT",
              + "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/APP_KEYS",
              + "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/ENCRYPTION_KEY",
              + "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/JWT_SECRET",
              + "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/TRANSFER_TOKEN_SALT",
              + (known after apply),
            ]
          + sid       = "ReadSsmParametersForInjection"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793",
            ]
          + sid       = "DecryptCmsSsmParameters"
        }
    }

  # module.platform.module.application.aws_db_instance.cms will be updated in-place
  ~ resource "aws_db_instance" "cms" {
      ~ backup_retention_period               = 7 -> 30
        id                                    = "db-IFW2HVA2RR22XVOXSTKMLAALH4"
        tags                                  = {
            "Environment" = "stage"
            "ManagedBy"   = "terraform"
            "Service"     = "cms"
        }
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ username                              = (sensitive value)
        # (72 unchanged attributes hidden)
    }

  # module.platform.module.application.aws_ecs_service.cms will be updated in-place
  ~ resource "aws_ecs_service" "cms" {
      ~ enable_execute_command             = false -> true
        id                                 = "arn:aws:ecs:us-east-2:031374266475:service/forge-cms-stage/forge-cms-stage-service"
        name                               = "forge-cms-stage-service"
      ~ tags                               = {
          - "Environment" = "stage" -> null
          - "ManagedBy"   = "terraform" -> null
          - "Service"     = "cms" -> null
        }
      ~ tags_all                           = {
          - "Environment" = "stage" -> null
          - "ManagedBy"   = "terraform" -> null
          - "Service"     = "cms" -> null
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:031374266475:task-definition/forge-cms-stage-task:6" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.platform.module.application.aws_ecs_task_definition.cms must be replaced
-/+ resource "aws_ecs_task_definition" "cms" {
      ~ arn                      = "arn:aws:ecs:us-east-2:031374266475:task-definition/forge-cms-stage-task:6" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:031374266475:task-definition/forge-cms-stage-task" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "forge-cms-stage-task" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "Environment" = "stage"
            "ManagedBy"   = "terraform"
            "Service"     = "cms"
        }
        # (13 unchanged attributes hidden)
    }

  # module.platform.module.application.aws_iam_role_policy.ecs_execution_secrets will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_execution_secrets" {
        id          = "forge-cms-stage-execution-role:forge-cms-stage-execution-secrets"
        name        = "forge-cms-stage-execution-secrets"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-east-2:031374266475:secret:rds!db-d7451672-ac58-4367-b108-27a607735078-R3xVdA"
                      - Sid      = "ReadRdsSecretForInjection"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/TRANSFER_TOKEN_SALT",
                          - "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/JWT_SECRET",
                          - "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/ENCRYPTION_KEY",
                          - "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/APP_KEYS",
                          - "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/API_TOKEN_SALT",
                          - "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/cms/stage/ADMIN_JWT_SECRET",
                        ]
                      - Sid      = "ReadSsmParametersForInjection"
                    },
                  - {
                      - Action   = "kms:Decrypt"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793"
                      - Sid      = "DecryptCmsSsmParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.platform.module.application.aws_iam_role_policy.ecs_task will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_task" {
        id          = "forge-cms-stage-task-role:forge-cms-stage-task-policy"
        name        = "forge-cms-stage-task-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "kms:GenerateDataKey",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:us-east-2:031374266475:key/ebf807b3-624c-4a0f-9e6f-4c08f0eaff3e"
                        Sid      = "KmsAssetsKeyUse"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "EcsExec"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.platform.module.application.aws_ssm_parameter.strapi_internal_api_token will be created
  + resource "aws_ssm_parameter" "strapi_internal_api_token" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793"
      + name             = "/forge/aws/cms/stage/STRAPI_INTERNAL_API_TOKEN"
      + region           = "us-east-2"
      + tags             = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

  # module.platform.module.assets.aws_s3_bucket_lifecycle_configuration.assets_access_logs will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "assets_access_logs" {
      + bucket                                 = "forge-cms-stage-assets-access-logs"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-log-objects"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }
        }
    }

  # module.iam.module.groups.module.admin_readonly.aws_iam_group.admin_readonly will be created
  + resource "aws_iam_group" "admin_readonly" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "forge-admin-readonly"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.iam.module.groups.module.admin_readonly.aws_iam_group_policy_attachment.admin_readonly will be created
  + resource "aws_iam_group_policy_attachment" "admin_readonly" {
      + group      = "forge-admin-readonly"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
    }

  # module.iam.module.groups.module.admin_readonly.aws_iam_group_policy_attachment.require_mfa will be created
  + resource "aws_iam_group_policy_attachment" "require_mfa" {
      + group      = "forge-admin-readonly"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.iam.module.groups.module.billing.aws_iam_group.billing will be created
  + resource "aws_iam_group" "billing" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "forge-billing"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.iam.module.groups.module.billing.aws_iam_group_policy.billing will be created
  + resource "aws_iam_group_policy" "billing" {
      + group       = "forge-billing"
      + id          = (known after apply)
      + name        = "forge-billing"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aws-portal:ViewUsage",
                          + "aws-portal:ViewPaymentMethods",
                          + "aws-portal:ViewBilling",
                          + "aws-portal:ViewAccount",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "BillingConsoleView"
                    },
                  + {
                      + Action   = [
                          + "aws-portal:ModifyPaymentMethods",
                          + "aws-portal:ModifyBilling",
                          + "aws-portal:ModifyAccount",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "BillingConsoleModify"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.iam.module.groups.module.billing.aws_iam_group_policy_attachment.require_mfa will be created
  + resource "aws_iam_group_policy_attachment" "require_mfa" {
      + group      = "forge-billing"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.iam.module.groups.module.login_profile.aws_iam_group.login_profile will be created
  + resource "aws_iam_group" "login_profile" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "forge-iam-login-profile"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.iam.module.groups.module.login_profile.aws_iam_group_policy.login_profile will be created
  + resource "aws_iam_group_policy" "login_profile" {
      + group       = "forge-iam-login-profile"
      + id          = (known after apply)
      + name        = "forge-iam-login-profile"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:UpdateLoginProfile",
                          + "iam:GetLoginProfile",
                          + "iam:DeleteLoginProfile",
                          + "iam:CreateLoginProfile",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::031374266475:user/*"
                      + Sid      = "LoginProfile"
                    },
                  + {
                      + Action   = [
                          + "iam:ListUsers",
                          + "iam:GetUser",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListUsers"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.iam.module.groups.module.login_profile.aws_iam_group_policy_attachment.require_mfa will be created
  + resource "aws_iam_group_policy_attachment" "require_mfa" {
      + group      = "forge-iam-login-profile"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.iam.module.groups.module.require_mfa.aws_iam_policy.require_mfa will be created
  + resource "aws_iam_policy" "require_mfa" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Requires MFA for all actions; allows MFA setup and self-service so users can enroll on first sign-in."
      + id               = (known after apply)
      + name             = "forge-require-mfa"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Condition = {
                          + BoolIfExists = {
                              + "aws:MultiFactorAuthPresent" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                      + Sid       = "DenyAllUnlessMFAPresent"
                    },
                  + {
                      + Action   = [
                          + "iam:ResyncMFADevice",
                          + "iam:ListVirtualMFADevices",
                          + "iam:ListMFADevices",
                          + "iam:GetUser",
                          + "iam:GetAccountPasswordPolicy",
                          + "iam:EnableMFADevice",
                          + "iam:DeleteVirtualMFADevice",
                          + "iam:CreateVirtualMFADevice",
                          + "iam:ChangePassword",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::031374266475:user/${aws:username}",
                          + "arn:aws:iam::031374266475:mfa/${aws:username}",
                          + "*",
                        ]
                      + Sid      = "AllowMFASetupAndSelfService"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "ManagedBy" = "terraform"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
        }
    }

  # module.iam.module.users.module.tataihono.data.aws_iam_group.admin_readonly will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_group" "admin_readonly" {
      + arn        = (known after apply)
      + group_id   = (known after apply)
      + group_name = "forge-admin-readonly"
      + id         = (known after apply)
      + path       = (known after apply)
      + users      = (known after apply)
    }

  # module.iam.module.users.module.tataihono.data.aws_iam_group.billing will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_group" "billing" {
      + arn        = (known after apply)
      + group_id   = (known after apply)
      + group_name = "forge-billing"
      + id         = (known after apply)
      + path       = (known after apply)
      + users      = (known after apply)
    }

  # module.iam.module.users.module.tataihono.data.aws_iam_group.login_profile will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_group" "login_profile" {
      + arn        = (known after apply)
      + group_id   = (known after apply)
      + group_name = "forge-iam-login-profile"
      + id         = (known after apply)
      + path       = (known after apply)
      + users      = (known after apply)
    }

  # module.iam.module.users.module.tataihono.aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "tataihono.nikora@jesusfilm.org"
      + path          = "/"
      + tags          = {
          + "ManagedBy" = "terraform"
          + "Role"      = "admin-readonly-billing"
        }
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Role"      = "admin-readonly-billing"
        }
      + unique_id     = (known after apply)
    }

  # module.iam.module.users.module.tataihono.aws_iam_user_group_membership.admin will be created
  + resource "aws_iam_user_group_membership" "admin" {
      + groups = [
          + "forge-admin-readonly",
          + "forge-billing",
          + "forge-iam-login-profile",
        ]
      + id     = (known after apply)
      + user   = "tataihono.nikora@jesusfilm.org"
    }

Plan: 17 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  - alb_domain_name                         = "cms.stage.forge.jesusfilm.org" -> null
  - assets_domain_name                      = "assets.stage.forge.jesusfilm.org" -> null
  - cloudfront_distribution_domain_name     = "d36jswd8wi2cvn.cloudfront.net" -> null
  - cms_assets_bucket_name                  = "forge-cms-stage-assets" -> null
  - cms_ssm_parameter_prefix                = "/forge/aws/cms/stage/" -> null
  - db_instance_endpoint                    = "forge-cms-stage-db.c9o8m6868p7e.us-east-2.rds.amazonaws.com" -> null
  - db_master_secret_arn                    = "arn:aws:secretsmanager:us-east-2:031374266475:secret:rds!db-d7451672-ac58-4367-b108-27a607735078-R3xVdA" -> null
  - ecr_repository_url                      = "031374266475.dkr.ecr.us-east-2.amazonaws.com/forge-cms-stage" -> null
  - ecs_cluster_name                        = "forge-cms-stage" -> null
  - forge_delegated_zone_name               = "forge.jesusfilm.org" -> null
  - forge_delegated_zone_name_servers       = [
      - "ns-696.awsdns-23.net",
      - "ns-232.awsdns-29.com",
      - "ns-2032.awsdns-62.co.uk",
      - "ns-1149.awsdns-15.org",
    ] -> null
  - github_actions_cms_deploy_role_arn      = "arn:aws:iam::031374266475:role/forge-github-actions-cms-deploy-stage" -> null
  - github_actions_terraform_apply_role_arn = "arn:aws:iam::031374266475:role/forge-github-actions-terraform-apply-stage" -> null
  - github_actions_terraform_plan_role_arn  = "arn:aws:iam::031374266475:role/forge-github-actions-terraform-plan-stage" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```